[{"data":1,"prerenderedAt":46},["ShallowReactive",2],{"content-query-bkEhIJFyih":3},{"_path":4,"_dir":5,"_draft":6,"_partial":6,"_locale":7,"title":8,"description":9,"date":10,"author":11,"body":12,"_type":40,"_id":41,"_source":42,"_file":43,"_stem":44,"_extension":45},"/blog/ubuntu-latest","blog",false,"","Waiting for a runner to pick up this job","Hoy tuve un problema con el CD/CI de Github. Al usar las acciones de Github con mi configuración, el proceso tardaba mucho tiempo en ejecutarse y se mostraba el mensaje \"Waiting for a runner to pick up this job\". Me pregunté qué significaba 'runner' y cómo podía resolver el problema.","2023-04-05","Jorge",{"type":13,"children":14,"toc":37},"root",[15,22,27,32],{"type":16,"tag":17,"props":18,"children":19},"element","p",{},[20],{"type":21,"value":9},"text",{"type":16,"tag":17,"props":23,"children":24},{},[25],{"type":21,"value":26},"Después de buscar en StackOverflow, descubrí que una posible razón podría ser que Github ya no soporta el sistema operativo que estaba solicitando. En mi caso, estaba usando \"ubuntu 18.04\" y tuve que cambiarlo a \"ubuntu-latest\" para que funcionara correctamente.",{"type":16,"tag":17,"props":28,"children":29},{},[30],{"type":21,"value":31},"Es probable que Github no soporte más esa versión de Ubuntu. Resulta que Github dejó de soportar Ubuntu 16.04 en septiembre de 2021, y sólo admite sistemas operativos específicos. Si estás teniendo problemas con las acciones de Github, verifica la lista de sistemas operativos soportados en la documentación oficial.",{"type":16,"tag":17,"props":33,"children":34},{},[35],{"type":21,"value":36},"Espero que esta información te sea útil si te encuentras con un problema similar. La solución puede ser tan simple como cambiar la versión del sistema operativo en tu archivo de configuración.",{"title":7,"searchDepth":38,"depth":38,"links":39},2,[],"markdown","content:blog:ubuntu-latest.md","content","blog/ubuntu-latest.md","blog/ubuntu-latest","md",1769621611679]